<template lang="pug">
svg(
  version="1.1" 
  xmlns="http://www.w3.org/2000/svg" 
  xmlns:xlink="http://www.w3.org/1999/xlink" 
  viewBox="0 0 1000 1050" 
  xml:space="preserve"
  )
  polygon(
    points="10,1020 500,0 990,1020"
    fill="#F6E3B7"
  )
  text(
    x="500"
    y="80"
    font-family="Mukta, sans-serif"
    font-size="18px"
    text-anchor="middle",
    dominant-baseline="middle"
  )
    tspan(x="50%" dy="-15" font-size="32px" font-weight="bold") ॐ
    tspan(x="50%" :dy="line + 15" font-weight="bold" font-size="22px") शिवसूत्रा
    tspan(x="50%" :dy="line + 10" font-weight="bold" fill="gray") शाम्भवोपाय
    tspan(x="50%" :dy="line")  चैतन्यमात्मा ॥१॥
    tspan(x="50%" :dy="line")  ज्ञानं बन्धः ॥२॥
    tspan(x="50%" :dy="line")  योनिवर्गः कलाशरीरम् ॥३॥
    tspan(x="50%" :dy="line") ज्ञानाधिष्ठानं मातृका ॥४॥
    tspan(x="50%" :dy="line") उद्यमो भैरवः ॥५॥
    tspan(x="50%" :dy="line") शक्तिचक्रसन्धाने विश्वसंहारः ॥६॥
    tspan(x="50%" :dy="line") जाग्रत्स्वप्नसुषुप्तभेदे तुर्याभोगसम्भवः ॥७॥
    tspan(x="50%" :dy="line") ज्ञानं जाग्रत् ॥८॥ स्वप्नो विकल्पाः ॥९॥
    tspan(x="50%" :dy="line") अविवेको मायासौषुप्तम् ॥१०॥ 
    tspan(x="50%" :dy="line") त्रितयभोक्ता वीरेशः ॥११॥  विस्मयो योगभूमिकाः ॥१२॥
    tspan(x="50%" :dy="line")  इच्छाशक्तिरुमा कुमारी ॥१३॥ दृश्यं शरीरम् ॥१४॥
    tspan(x="50%" :dy="line") हृदये चित्तसङ्घट्टाद्दृश्यस्वापदर्शनम् ॥१५॥
    tspan(x="50%" :dy="line")  शुद्धतत्त्वसन्धानाद्वापशुशक्तिः ॥१६॥  वितर्क आत्मज्ञानम् ॥१७॥ 
    tspan(x="50%" :dy="line") लोकानन्दः समाधिसुखम् ॥१८॥   शक्तिसन्धाने शरीरोत्पत्तिः ॥१९॥ 
    tspan(x="50%" :dy="line") भूतसन्धानभूतपृथक्त्वविश्वसङ्घट्टाः ॥२०॥
    tspan(x="50%" :dy="line")  शुद्धविद्योदयाच्चक्रेशत्वसिद्धिः ॥२१॥  महाह्रदानुसन्धानान्मन्त्रवीर्यानुभवः ॥२२॥

    tspan(x="50%" :dy="line + 10" font-weight="bold" fill="gray") शाक्तोपाय
    tspan(x="50%" :dy="line")  चित्तं मन्त्रः ॥१॥ प्रयत्नः साधकः ॥२॥ विद्याशरीरसत्ता मन्त्ररहस्यम् ॥३॥
    tspan(x="50%" :dy="line") गर्भे चित्तविकासोऽविशिष्टविद्यास्वप्नः ॥४॥  विद्यासमुत्थाने स्वाभाविके खेचरी शिवावस्था ॥५॥
    tspan(x="50%" :dy="line") गुरुरुपायः ॥६॥ मातृकाचक्रसम्बोधः ॥७॥ शरीरं हविः ॥८॥ ज्ञानमन्नम् ॥९॥ 
    tspan(x="50%" :dy="line")   विद्यासंहारे तदुत्थस्वप्नदर्शनम् ॥१०॥

    tspan(x="50%" :dy="line").
    tspan(x="50%" :dy="line + 10" font-weight="bold" fill="gray")  आणवोपाय
    tspan(x="500" :dy="line")  आत्मा चित्तम् ॥१॥ ज्ञानं बन्धः ॥२॥ कलादीनां तत्त्वानामविवेको माया ॥३॥  शरीरे संहारः कलानाम् ॥४॥ 
    tspan(x="50%" :dy="line") डीसंहारभूतजयभूतकैवल्यभूतपृथक्त्वानि ॥५॥ मोहावरणात्सिद्धिः ॥६॥ मोहजयादनन्ताभोगात्सहजविद्याजयः ॥७॥ 
    tspan(x="50%" :dy="line")  जाग्रद्द्वितीयकरः ॥८॥ नर्तक आत्मा ॥९॥ रङ्गोऽन्तरात्मा ॥१०॥ प्रेक्षकाणीन्द्रियाणि ॥११॥
    tspan(x="50%" :dy="line")  धीवशात्सत्त्वसिद्धिः ॥१२॥ सिद्धः स्वतन्त्रभावः ॥१३॥  यथा तत्र तथान्यत्र ॥१४॥ बीजावधानम् ॥१५॥
    tspan(x="50%" :dy="line") आसनस्थः सुखं ह्रदे निमज्जति ॥१६॥  स्वमात्रानिर्माणमापादयति ॥१७॥  विद्याविनाशे जन्मविनाशः ॥१८॥ 
    tspan(x="50%" :dy="line")  कवर्गादिषु माहेश्वर्याद्याः पशुमातरः ॥१९॥ त्रिषु चतुर्थं तैलवदासेच्यम् ॥२०॥  मग्नः स्वचित्तेन प्रविशेत् ॥२१॥
    tspan(x="50%" :dy="line")  प्राणसमाचारे समदर्शनम् ॥२२॥ मध्येऽवरप्रसवः ॥२३॥  मात्रास्वप्रत्ययसन्धाने नष्टस्य पुनरुत्थानम् ॥२४॥ शिवतुल्यो जायते ॥२५॥
    tspan(x="50%" :dy="line") शरीरवृत्तिर्व्रतम् ॥२६॥  कथा जपः ॥२७॥  दानमात्मज्ञानम् ॥२८॥  योऽविपस्थो ज्ञाहेतुश्च ॥२९॥  स्वशक्तिप्रचयोऽस्य विश्वम् ॥३०॥
    tspan(x="50%" :dy="line") स्थितिलयौ ॥३१॥ तत्प्रवृत्तावप्यनिरासः संवेत्तृभावात् ॥३२॥ सुखदुःखयोर्बहिर्मननम् ॥३३॥ तद्विमुक्तस्तु केवली ॥३४॥ 
    tspan(x="50%" :dy="line") मोहप्रतिसंहतस्तु कर्मात्मा ॥३५॥ भेदतिरस्कारे सर्गान्तरकर्मत्वम् ॥३६॥  करणशक्तिः स्वतोऽनुभवात् ॥३७॥  त्रिपदाद्यनुप्राणनम् ॥३८॥
    tspan(x="50%" :dy="line") चित्तस्थितिवच्छरीरकरणबाह्येषु ॥३९॥ अभिलाषाद्बहिर्गतिः संवाह्यस्य ॥४०॥ तदारूढप्रमितेस्तत्क्षयाज्जीवसङ्क्षयः ॥४१॥
    tspan(x="50%" :dy="line") भूतकञ्चुकी तदा विमुक्तो भूयः पतिसमः परः ॥४२॥  नैसर्गिकः प्राणसम्बन्धः ॥४३॥ नासिकान्तर्मध्यसंयमात् किमत्र सव्यापसव्यसौषुम्नेषु ॥४४॥
    tspan(x="50%" :dy="line") भूयः स्यात्प्रतिमीलनम् ॥४५॥
</template>

<script setup>
const line = 24;
</script>

<style scoped>
</style>